Revit 2026 API

# MultistoryStairsActualTreadDepth Property

---

The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ActualTreadDepth { get; set; }
```
```vb
Public Property ActualTreadDepth As Double
	Get
	Set
```
```cpp
public:
property double ActualTreadDepth {
	double get ();
	void set (double value);
}
```
```fsharp
member ActualTreadDepth : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet. |

In a multistory stairs, all the stairs elements keep the same tread depth parameter value.

#### Reference

MultistoryStairs Class

Autodesk.Revit.DB.Architecture Namespace